load-test/votaciones-test.yml
config:
  target: "https://votacionesqa.servicios-alcaldiapereira.com"
  phases:
    - duration: 60
      arrivalRate: 200      # puede ajustar entre 100-1000 usuarios por segundo
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
  processor: "./processor.js"

scenarios:
  - name: "Login + Voto concurrente"
    flow:
      # 1️⃣ Login de usuario
      - post:
          url: "/login"
          json:
            email: "usuario{{ randomInt(2,1000) }}@example.com"
            password: "12345678"
          capture:
            - json: "$.token"     # depende de cómo devuelva el backend el token
              as: "authToken"

      # 2️⃣ Envío del voto
      - post:
          url: "votos"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            votante_id: "{{ randomInt(2, 1000) }}"
            evento_id: 16
            proyecto_id: "{{ randomInt(14, 15) }}"
      - think: 1